command-line-programs.html
<div id="outline-container-org9cdae71" class="outline-2">
<h2 id="org9cdae71"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is to provide a detailed checklist on what makes for a good command line
program.
</p>

<p>
The quick list:
</p>

<ol class="org-ol">
<li>Provide usage information.</li>
<li>Output parse-able output to <code>stdout</code>.</li>
<li>Output logging to <code>stderr</code>.</li>
<li>Have a <code>--help</code> that describes basic usage and general purpose.</li>
<li>Use exit code 0 for expected results, and positive, non-zero exit codes for
unexpected results.</li>
</ol>
</div>
</div>
<div id="outline-container-orgfdb67f5" class="outline-2">
<h2 id="orgfdb67f5"><span class="section-number-2">2.</span> Disclaimer</h2>
<div class="outline-text-2" id="text-2">
<p>
You can always view my <a href="./resume.html">résumé</a> here on the blog.  From that you can infer a lot
about my experience and things I&rsquo;ve done.  I don&rsquo;t wish to appeal to authority,
but having some experience in the field should amount to something.  I deal with
this stuff on a day to day basis, and from that I&rsquo;ve learned some things.  You
can decide for yourself if it&rsquo;s poorly acquired trauma or wisdom that comes with
age.
</p>

<p>
I tend to examine &ldquo;standards&rdquo; with high levels of scrutiny, as they can be put
together by almost anyone with vast quantities of spare time and an unhealthy
addiction to work.  I hope my work here is placed under similar scrutiny.  Bad
ideas should perish and good ideas should thrive.  Of course, the real world
contains a lot of nuance.  I find it best to know what the ideal course is, and
then deviate as needs dictate.
</p>

<p>
You will not gain my support by quoting my words as truth.  But use this to be
inspired to pitch your own arguments and form your own ideas.
</p>

<p>
In short: I know some things.  I think to think for myself.  So should you,
including scrutinizing anything I emit.
</p>
</div>
</div>
<div id="outline-container-org032ef19" class="outline-2">
<h2 id="org032ef19"><span class="section-number-2">3.</span> Help and Usage</h2>
<div class="outline-text-2" id="text-3">
<p>
The <a href="https://agilemanifesto.org">Agile Manifesto</a> tells us to favor &ldquo;working software over comprehensive
documentation&rdquo;, but I find this akin to waiting until someone falls in a hole
and dies before you decide to put up a sign that there&rsquo;s a hole where one could
fall in and die.
</p>

<p>
Providing a help/usage information for your program is a must-have. Even
simplistic programs should provide a brief description of what they do and any
arguments they expect. The <span class="underline">program</span> must provide this information, not your
code (though that has incredible merit as well).
</p>

<p>
When a program isn&rsquo;t provided the information it needs, the <b>minimal</b> operation
is to display the usage information and quit with a non-zero exit code.
</p>

<p>
The usage information itself describes the arguments available, order (if
applicable), required arguments vs. optional, and if the argument can be
repeated (such as file names).
</p>

<p>
IEEE has a <a href="https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap12.html">Utility Conventions</a> document that covers a standard formatting
convention to use. Most programs I&rsquo;ve seen use this convention, and there&rsquo;s not
really a great reason to abandon it. Many command line argument libraries
provide this usage information automatically, but the onus is always on the
program maintainer to provide documentation as to the purpose of the arguments
themselves.
</p>

<p>
Some programs can be very complicated and so require lots of explanations,
examples, warnings, etc. This is where a <a href="https://liw.fi/manpages/">manual page</a> (or &ldquo;man page&rdquo;) comes in
handy. I wouldn&rsquo;t worry too much about the ancient <code>troff</code> format. <a href="https://pandoc.org/">Pandoc</a>
supports <a href="https://www.gnu.org/software/groff/groff.html">groff</a> (GNU&rsquo;s <code>troff</code>) and therefore can convert Markdown and Org-mode
documents to man pages. Though I would check to make sure the output is rendered
in a canonical fashion: There might be things in <code>troff</code> that a format like
Markdown doesn&rsquo;t represent well like glossary definitions, for example.
</p>

<p>
Your bare minimum can include the script name (which can typically be determined
automatically), and any arguments you need.
</p>

<p>
Here&rsquo;s an example of a bash script with zero arguments. You can use <code>$0</code> to
refer to the script itself, and subsequent numbers refer to the ordered
arguments. So <code>$1</code> is the first argument after the script name.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #62686E;">#</span><span style="color: #62686E;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #62686E;"> bash</span>

<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #C57BDB;">[</span> $<span style="color: #e69055; font-weight: bold;">1</span> == <span style="color: #7bc275;">'--help'</span> || $<span style="color: #e69055; font-weight: bold;">1</span> == <span style="color: #7bc275;">'-h'</span> <span style="color: #C57BDB;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">"usage: </span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">0</span>

<span style="color: #7bc275;">Frobnicates anything needing frobnication.</span>
<span style="color: #7bc275;">"</span>
  <span style="color: #51afef;">exit</span> <span style="color: #e69055; font-weight: bold;">0</span>
<span style="color: #51afef;">fi</span>

<span style="color: #62686E;"># </span><span style="color: #62686E;">The rest of the script goes below.</span>
</pre>
</div>
</div>
</div>
