command-line-programs.html
<div id="outline-container-orgbf669ed" class="outline-2">
<h2 id="orgbf669ed"><span class="section-number-2">4.</span> Logging and Output</h2>
<div class="outline-text-2" id="text-4">
<p>
Typically a lot of command line programs are rather silent - they don&rsquo;t output
much. It&rsquo;s totally fine though to sprinkle logging throughout your program - in
fact, for all but the most trivial programs I encourage this! But be sure to
provide a distinction between <b>logging</b> and <b>output</b>.
</p>

<p>
The <a href="https://en.wikipedia.org/wiki/Unix_philosophy">Unix philosopy</a> has a lot of useful tidbits in it, but of particular note is
this item:
</p>

<blockquote>
<p>
Expect the output of every program to become the input to another, as yet
unknown, program. Don&rsquo;t clutter output with extraneous information. Avoid
stringently columnar or binary input formats. Don&rsquo;t insist on interactive input.
</p>
</blockquote>

<p>
This flows into very practical advice for logging and your program output.
</p>
</div>
<div id="outline-container-org18b3815" class="outline-3">
<h3 id="org18b3815"><span class="section-number-3">4.1.</span> Logging and Log Levels</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Logging is the program printing out diagnostic or progress information to the
user. &ldquo;Found file X&rdquo;, &ldquo;Calling server with $URL&rdquo;, and &ldquo;Server rejected our call
with message&#x2026;&rdquo; are all great things to have in your logs. Logs should always
go to <code>stderr</code> (standard error). Different languages tend to use different names
for this. Ruby&rsquo;s writing to <code>stderr</code> is called <code>warn</code> and Node.JS uses
<code>console.error</code>. That said, it&rsquo;s recommended to use a logger with log levels.
This way you can distinguish apart messages for errors, general information,
warnings, debugging statements, and so on. Most loggers can be configured to
point at a particular destination. One of those can be whatever your languages
uses for <code>stderr</code>, which is covered in your language&rsquo;s documentation. Logging
always goes to <code>stderr</code> so that other programs (usually shells) can use program
output without having to be aware of any kind of logging. We&rsquo;ll cover this more
in <a href="#orga68ffe1">4.2</a>.
</p>

<p>
Additionally for logging, this sort of information can be provided via
arguments. I&rsquo;ve seen <code>--debug</code>, <code>--verbose</code>, <code>--info</code> and other flags like this.
I don&rsquo;t prefer them because they are both subjective. I&rsquo;ve seen a suite of
programs inconsistently use <code>--debug</code> and <code>--verbose</code> for the same thing, for
example. Additionally, if both <code>--debug</code> and <code>--info</code> arrive as a result of some
automation gone wonky, what happens there? Does it log <code>--debug</code>? <code>--info</code>? Does
your documentation state which one wins? Or do you put in login into the
argument handling to make sure these are exclusive arguments? I really like how
<code>ssh</code> handles it: There is a single short-hand <code>-v</code> argument for verbosity. You
can dial up the verbosity with additional &ldquo;v&rdquo;s. So <code>-vvv</code> is the 3rd level of
verbosity.
</p>
</div>
</div>
<div id="outline-container-orga68ffe1" class="outline-3">
<h3 id="orga68ffe1"><span class="section-number-3">4.2.</span> Output</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Output should always be printed to <code>stdout</code> (apart from logging, which goes to
<code>stderr</code>). This allows other programs (such as shells) to easily work with
output. For example, <code>curl</code> uses this pattern to much obviousness:
</p>

<div class="org-src-container">
<pre class="src src-shell"> <span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">'* foo'</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell"> <span style="color: #FCCE7B;">curl</span> -k --verbose --silent https://google.com &gt; /dev/null
</pre>
</div>

<p>
Here, you can see all of the verbose information that curl prints - headers in
both the request and response, as well as the SSL handshake. We could redirect
that to a saved file.
</p>
</div>
</div>
</div>
