content/posts/command-line-programs.md


## Logging and Output {#logging-and-output}

Typically a lot of command line programs are rather silent - they don't output
much. It's totally fine though to sprinkle logging throughout your program - in
fact, for all but the most trivial programs I encourage this! But be sure to
provide a distinction between **logging** and **output**.

The [Unix philosopy](https://en.wikipedia.org/wiki/Unix_philosophy) has a lot of useful tidbits in it, but of particular note is
this item:

> Expect the output of every program to become the input to another, as yet
> unknown, program. Don't clutter output with extraneous information. Avoid
> stringently columnar or binary input formats. Don't insist on interactive input.

This flows into very practical advice for logging and your program output.


### Logging and Log Levels {#logging-and-log-levels}

Logging is the program printing out diagnostic or progress information to the
user. "Found file X", "Calling server with $URL", and "Server rejected our call
with message..." are all great things to have in your logs. Logs should always
go to `stderr` (standard error). Different languages tend to use different names
for this. Ruby's writing to `stderr` is called `warn` and Node.JS uses
`console.error`. That said, it's recommended to use a logger with log levels.
This way you can distinguish apart messages for errors, general information,
warnings, debugging statements, and so on. Most loggers can be configured to
point at a particular destination. One of those can be whatever your languages
uses for `stderr`, which is covered in your language's documentation. Logging
always goes to `stderr` so that other programs (usually shells) can use program
output without having to be aware of any kind of logging. We'll cover this more
in [Output](#output).

Additionally for logging, this sort of information can be provided via
arguments. I've seen `--debug`, `--verbose`, `--info` and other flags like this.
I don't prefer them because they are both subjective. I've seen a suite of
programs inconsistently use `--debug` and `--verbose` for the same thing, for
example. Additionally, if both `--debug` and `--info` arrive as a result of some
automation gone wonky, what happens there? Does it log `--debug`? `--info`? Does
your documentation state which one wins? Or do you put in login into the
argument handling to make sure these are exclusive arguments? I really like how
`ssh` handles it: There is a single short-hand `-v` argument for verbosity. You
can dial up the verbosity with additional "v"s. So `-vvv` is the 3rd level of
verbosity.


### Output {#output}

Output should always be printed to `stdout` (apart from logging, which goes to
`stderr`). This allows other programs (such as shells) to easily work with
output. For example, `curl` uses this pattern to much obviousness:

```shell
echo '* foo'
```

```shell
curl -k --verbose --silent https://google.com > /dev/null
```

Here, you can see all of the verbose information that curl prints - headers in
both the request and response, as well as the SSL handshake. We could redirect
that to a saved file.
