command-line-programs.org
* Exit Codes

Exit codes are unsigned 8 bit numbers (0-255). 0 is interpreted as success.
Everything else is a failure. These are used to not only detect failures in a
series of programs, but also determine what kind of failure.

#+begin_src shell :results output :prologue exec 2>&1 :epilogue "true"
nosuchcommand # Run a fake command to create a failure.
#+end_src

#+RESULTS:
: bash: line 2: nosuchcommand: command not found

By default, shells will keep running commands regardless of failure. This can
have poor consequences.

#+begin_src shell :results output :prologue exec 2>&1 :epilogue "true"
create-report-now-please my-report.rpt # Fake command. Will fail.
# my-report.rpt was never created by the time we get here. Since there are no
# reports, this publish-all-reports command could omit any errors since there
# are no reports found to publish, or perhaps it found some reports, but just
# not "my-report.rpt".
publish-all-reports
#+end_src

** Standard Exit Codes :archive:

I need to vet this before publishing it.

There are some standards for exit codes as well.  The advanced Bash guide covers
[[https://tldp.org/LDP/abs/html/exitcodes.html][exit codes of reserved meaning in Bash]].  This is not quite the same as a
standard for which all outcomes could be cataloged.  Instead this gives us some
predictable outcome.

While I have found many to find this kind of thing archaic.  It's not terribly
different from how the vaunted HTTP standard works.  [[https://developer.mozilla.org/en-US/docs/Web/HTTP/Status][HTTP codes]] rain [[https://http.cat][cats]] and
[[https://http.dog][dogs]] from the standard.
