command-line-programs.html
<div id="outline-container-org3ea6e3a" class="outline-2">
<h2 id="org3ea6e3a"><span class="section-number-2">5.</span> Exit Codes</h2>
<div class="outline-text-2" id="text-5">
<p>
Exit codes are unsigned 8 bit numbers (0-255). 0 is interpreted as success.
Everything else is a failure. These are used to not only detect failures in a
series of programs, but also determine what kind of failure.
</p>

<div class="org-src-container">
<pre class="src src-shell">nosuchcommand <span style="color: #62686E;"># </span><span style="color: #62686E;">Run a fake command to create a failure.</span>
</pre>
</div>

<p>
By default, shells will keep running commands regardless of failure. This can
have poor consequences.
</p>

<div class="org-src-container">
<pre class="src src-shell">create-report-now-please my-report.rpt <span style="color: #62686E;"># </span><span style="color: #62686E;">Fake command. Will fail.</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">my-report.rpt was never created by the time we get here. Since there are no</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">reports, this publish-all-reports command could omit any errors since there</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">are no reports found to publish, or perhaps it found some reports, but just</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">not "my-report.rpt".</span>
publish-all-reports
</pre>
</div>
</div>
<div id="outline-container-org78f6a4a" class="outline-3">
<h3 id="org78f6a4a"><span class="section-number-3">5.1.</span> Standard Exit Codes<span class="tag"><span class="archive">archive</span></span></h3>
<div class="outline-text-3" id="text-5-1">
<p>
I need to vet this before publishing it.
</p>

<p>
There are some standards for exit codes as well.  The advanced Bash guide covers
<a href="https://tldp.org/LDP/abs/html/exitcodes.html">exit codes of reserved meaning in Bash</a>.  This is not quite the same as a
standard for which all outcomes could be cataloged.  Instead this gives us some
predictable outcome.
</p>

<p>
While I have found many to find this kind of thing archaic.  It&rsquo;s not terribly
different from how the vaunted HTTP standard works.  <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Status">HTTP codes</a> rain <a href="https://http.cat">cats</a> and
<a href="https://http.dog">dogs</a> from the standard.
</p>
</div>
</div>
</div>
